### scikit-learn
Strona biblioteki: [https://scikit-learn.org](https://scikit-learn.org)  

Dokumentacja/User Guide: [https://scikit-learn.org/stable/user_guide.html](https://scikit-learn.org/stable/user_guide.html)

Podstawowa biblioteka do uczenia maszynowego w języku Python.

Aby zainstalować bibliotekę scikit-learn, użyj polecenia poniżej:
```
!pip install scikit-learn
```
Aby zaktualizować do najnowszej wersji bibliotekę scikit-learn, użyj polecenia poniżej:
```
!pip install --upgrade scikit-learn
```
Kurs stworzony w oparciu o wersję `0.22.1`

### Spis treści:
1. [Import bibliotek](#0)
2. [Załadowanie danych](#1)
3. [Utworzenie kopii danych](#2)
4. [Generowanie nowych zmiennych](#3)
5. [Dyskretyzacja zmiennej ciągłej](#4)
6. [Ekstrakcja cech](#5)

### <a name='0'></a> Import bibliotek

In [1]:
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

'1.8.0'

### <a name='1'></a> Załadowanie danych

In [2]:
!pip install yfinance

Collecting yfinance
  Using cached yfinance-0.2.66-py2.py3-none-any.whl.metadata (6.0 kB)
Requirement already satisfied: pandas>=1.3.0 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (2.3.3)
Requirement already satisfied: numpy>=1.16.5 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (2.3.5)
Requirement already satisfied: requests>=2.31 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (2.32.5)
Collecting multitasking>=0.0.7 (from yfinance)
  Using cached multitasking-0.0.12-py3-none-any.whl
Requirement already satisfied: platformdirs>=2.0.0 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (4.5.1)
Requirement already satisfied: pytz>=2022.5 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (2025.2)
Collecting frozendict>=2.3.4 (from yfinance)
  Using cached frozendict-2.4.7-py3-none-any.whl.metadata (23 kB)
Collecting peewee>=3.16.2 (from yfinance)
  Using cached peewee-3.18.3-cp313-cp313-macosx_10_13_universal2.whl
Collecting beautifulsoup4>=4.11.1 (from yfinance)
  Using cached beautifulsoup4-4.14.3-py3-none-any.whl.metadata (3.8 kB)
Collecting curl_cffi>=0.7 (from yfinance)
  Downloading curl_cffi-0.14.0-cp39-abi3-macosx_14_0_arm64.whl.metadata (15 kB)
Requirement already satisfied: protobuf>=3.19.0 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from yfinance) (6.33.2)
Collecting websockets>=13.0 (from yfinance)
  Using cached websockets-15.0.1-cp313-cp313-macosx_11_0_arm64.whl.metadata (6.8 kB)
Collecting soupsieve>=1.6.1 (from beautifulsoup4>=4.11.1->yfinance)
  Using cached soupsieve-2.8-py3-none-any.whl.metadata (4.6 kB)
Requirement already satisfied: typing-extensions>=4.0.0 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from beautifulsoup4>=4.11.1->yfinance) (4.15.0)
Collecting cffi>=1.12.0 (from curl_cffi>=0.7->yfinance)
  Using cached cffi-2.0.0-cp313-cp313-macosx_11_0_arm64.whl.metadata (2.6 kB)
Requirement already satisfied: certifi>=2024.2.2 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from curl_cffi>=0.7->yfinance) (2025.11.12)
Collecting pycparser (from cffi>=1.12.0->curl_cffi>=0.7->yfinance)
  Using cached pycparser-2.23-py3-none-any.whl.metadata (993 bytes)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from pandas>=1.3.0->yfinance) (2025.3)
Requirement already satisfied: six>=1.5 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas>=1.3.0->yfinance) (1.17.0)
Requirement already satisfied: charset_normalizer<4,>=2 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from requests>=2.31->yfinance) (3.4.4)
Requirement already satisfied: idna<4,>=2.5 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from requests>=2.31->yfinance) (3.11)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/tomasz/Desktop/ML_DL_Python_Comarch/.venv/lib/python3.13/site-packages (from requests>=2.31->yfinance) (2.6.2)
Using cached yfinance-0.2.66-py2.py3-none-any.whl (123 kB)
Using cached beautifulsoup4-4.14.3-py3-none-any.whl (107 kB)
Downloading curl_cffi-0.14.0-cp39-abi3-macosx_14_0_arm64.whl (3.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.1/3.1 MB 19.1 MB/s  0:00:00 eta 0:00:01
Using cached cffi-2.0.0-cp313-cp313-macosx_11_0_arm64.whl (181 kB)
Using cached frozendict-2.4.7-py3-none-any.whl (16 kB)
Using cached soupsieve-2.8-py3-none-any.whl (36 kB)
Using cached websockets-15.0.1-cp313-cp313-macosx_11_0_arm64.whl (173 kB)
Using cached pycparser-2.23-py3-none-any.whl (118 kB)
Installing collected packages: peewee, multitasking, websockets, soupsieve, pycparser, frozendict, cffi, beautifulsoup4, curl_cffi, yfinance
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10/10 [yfinance]/10 [curl_cffi]]
Successfully installed beautifulsoup4-4.14.3 cffi-2.0.0 curl_cffi-0.14.0 frozendict-2.4.7 multitasking-0.0.12 peewee-3.18.3 pycparser-2.23 soupsieve-2.8 websockets-15.0.1 yfinance-0.2.66

Funkcja _fetch_financial_data()_ pobiera dane dotyczące notowań spółek giełdowych. Będzie wykorzystywana w poniższych ćwiczeniach. Aby pobrać dane konkretnej spółki należy przekazać odpowiedni ticker (symbol) spółki.

Kilka przykładowych tickerów spółek:
* AMZN - Amazon
* GOOGL - Google
* MSFT - Microsoft
* AAPL - Apple
* NKE - Nike
* WMT - Walmart

In [3]:
import yfinance as yf

def fetch_financial_data(company='AMZN'):
    """
    Funkcja pobiera notowania giełdowe z yfinance.
    """
    ticker = yf.Ticker(company)
    data = ticker.history(period='max')
    return data

In [4]:
df_raw = fetch_financial_data()

In [7]:
df_raw

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
1997-05-15 00:00:00-04:00,0.121875,0.125000,0.096354,0.097917,1443120000,0.0,0.0
1997-05-16 00:00:00-04:00,0.098438,0.098958,0.085417,0.086458,294000000,0.0,0.0
1997-05-19 00:00:00-04:00,0.088021,0.088542,0.081250,0.085417,122136000,0.0,0.0
1997-05-20 00:00:00-04:00,0.086458,0.087500,0.081771,0.081771,109344000,0.0,0.0
1997-05-21 00:00:00-04:00,0.081771,0.082292,0.068750,0.071354,377064000,0.0,0.0
...,...,...,...,...,...,...,...
2025-12-11 00:00:00-05:00,230.710007,232.110001,228.690002,230.279999,28249600,0.0,0.0
2025-12-12 00:00:00-05:00,229.869995,230.080002,225.119995,226.190002,35639100,0.0,0.0
2025-12-15 00:00:00-05:00,227.929993,227.929993,221.500000,222.539993,47286100,0.0,0.0
2025-12-16 00:00:00-05:00,223.039993,223.660004,221.130005,222.559998,39298900,0.0,0.0
2025-12-17 00:00:00-05:00,224.660004,225.190002,220.990005,221.270004,43951500,0.0,0.0

### <a name='2'></a> Utworzenie kopii danych

In [5]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 1997-05-15 00:00:00-04:00 to 1997-05-21 00:00:00-04:00
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Open          5 non-null      float64
 1   High          5 non-null      float64
 2   Low           5 non-null      float64
 3   Close         5 non-null      float64
 4   Volume        5 non-null      int64
 5   Dividends     5 non-null      float64
 6   Stock Splits  5 non-null      float64
dtypes: float64(6), int64(1)
memory usage: 320.0 bytes

In [8]:
df

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
1997-05-15 00:00:00-04:00,0.121875,0.125000,0.096354,0.097917,1443120000,0.0,0.0
1997-05-16 00:00:00-04:00,0.098438,0.098958,0.085417,0.086458,294000000,0.0,0.0
1997-05-19 00:00:00-04:00,0.088021,0.088542,0.081250,0.085417,122136000,0.0,0.0
1997-05-20 00:00:00-04:00,0.086458,0.087500,0.081771,0.081771,109344000,0.0,0.0
1997-05-21 00:00:00-04:00,0.081771,0.082292,0.068750,0.071354,377064000,0.0,0.0

### <a name='3'></a> Generowanie nowych zmiennych

In [9]:
df.index.month

Index([5, 5, 5, 5, 5], dtype='int32', name='Date')

In [10]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

,Open,High,Low,Close,Volume,Dividends,Stock Splits,day,month,year
Date,,,,,,,,,,
1997-05-15 00:00:00-04:00,0.121875,0.125000,0.096354,0.097917,1443120000,0.0,0.0,15,5,1997
1997-05-16 00:00:00-04:00,0.098438,0.098958,0.085417,0.086458,294000000,0.0,0.0,16,5,1997
1997-05-19 00:00:00-04:00,0.088021,0.088542,0.081250,0.085417,122136000,0.0,0.0,19,5,1997
1997-05-20 00:00:00-04:00,0.086458,0.087500,0.081771,0.081771,109344000,0.0,0.0,20,5,1997
1997-05-21 00:00:00-04:00,0.081771,0.082292,0.068750,0.071354,377064000,0.0,0.0,21,5,1997

### <a name='4'></a> Dyskretyzacja zmiennej ciągłej

In [11]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [12]:
df['height_cat'] = pd.cut(x=df.height, bins=3)
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [13]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195))
df

   height  height_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [14]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195), labels=['small', 'medium', 'high'])
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [16]:
pd.get_dummies(df, prefix='height', dtype=int)

   height  height_small  height_medium  height_high
0   175.0             1              0            0
1   178.5             0              1            0
2   185.0             0              0            1
3   191.0             0              0            1
4   184.5             0              0            1
5   183.0             0              0            1
6   168.0             1              0            0

### <a name='5'></a> Ekstrakcja cech

In [17]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [18]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [20]:
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [21]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [22]:
df.website.str.split('.', expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [23]:
new = df.website.str.split('.', expand=True)
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com